# CurrentObject Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointIterator..::..CurrentObject Property
PointIterator Class See Also
---
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Object CurrentObject { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurrentObject As Object
	Get
```

Visual C++
---
```text
public:
virtual property Object^ CurrentObject {
	Object^ get () sealed;
}
```

# ### Implements
IEnumerator..::..Current
# See Also
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace